HITSIC/HITSIC_RT1052/HITSIC_RT1052_MCUX/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RTEPIN_AllPin
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void RTEPIN_AllPin(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           
  CLOCK_EnableClock(kCLOCK_Xbar1);            
  CLOCK_EnableClock(kCLOCK_Xbar2);            

  /* GPIO configuration of LED_BUSR on GPIO_AD_B0_00 (pin M14) */
  gpio_pin_config_t LED_BUSR_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_00 (pin M14) */
  GPIO_PinInit(GPIO1, 0U, &LED_BUSR_config);

  /* GPIO configuration of KEY_BTUS on GPIO_AD_B0_01 (pin H10) */
  gpio_pin_config_t KEY_BTUS_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_01 (pin H10) */
  GPIO_PinInit(GPIO1, 1U, &KEY_BTUS_config);

  /* GPIO configuration of LED_BUSG on GPIO_AD_B0_02 (pin M11) */
  gpio_pin_config_t LED_BUSG_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_02 (pin M11) */
  GPIO_PinInit(GPIO1, 2U, &LED_BUSG_config);

  /* GPIO configuration of LED_USR on GPIO_AD_B0_03 (pin G11) */
  gpio_pin_config_t LED_USR_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_03 (pin G11) */
  GPIO_PinInit(GPIO1, 3U, &LED_USR_config);

  /* GPIO configuration of CAM_RST on GPIO_AD_B1_03 (pin M12) */
  gpio_pin_config_t CAM_RST_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_03 (pin M12) */
  GPIO_PinInit(GPIO1, 19U, &CAM_RST_config);

  /* GPIO configuration of DISP_D_C on GPIO_B0_00 (pin D7) */
  gpio_pin_config_t DISP_D_C_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_00 (pin D7) */
  GPIO_PinInit(GPIO2, 0U, &DISP_D_C_config);

  /* GPIO configuration of DISP_BKL on GPIO_B0_01 (pin E7) */
  gpio_pin_config_t DISP_BKL_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_01 (pin E7) */
  GPIO_PinInit(GPIO2, 1U, &DISP_BKL_config);

  /* GPIO configuration of TOF1_INT on GPIO_B0_12 (pin C10) */
  gpio_pin_config_t TOF1_INT_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_12 (pin C10) */
  GPIO_PinInit(GPIO2, 12U, &TOF1_INT_config);

  /* GPIO configuration of TOF1_XHT on GPIO_B0_13 (pin D10) */
  gpio_pin_config_t TOF1_XHT_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_13 (pin D10) */
  GPIO_PinInit(GPIO2, 13U, &TOF1_XHT_config);

  /* GPIO configuration of TOF0_INT on GPIO_B0_14 (pin E10) */
  gpio_pin_config_t TOF0_INT_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_14 (pin E10) */
  GPIO_PinInit(GPIO2, 14U, &TOF0_INT_config);

  /* GPIO configuration of TOF0_XHT on GPIO_B0_15 (pin E11) */
  gpio_pin_config_t TOF0_XHT_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_15 (pin E11) */
  GPIO_PinInit(GPIO2, 15U, &TOF0_XHT_config);

  /* GPIO configuration of KEY_BTME on GPIO_B1_01 (pin B11) */
  gpio_pin_config_t KEY_BTME_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_01 (pin B11) */
  GPIO_PinInit(GPIO2, 17U, &KEY_BTME_config);

  /* GPIO configuration of MOTOR_EN on GPIO_B1_02 (pin C11) */
  gpio_pin_config_t MOTOR_EN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_02 (pin C11) */
  GPIO_PinInit(GPIO2, 18U, &MOTOR_EN_config);

  /* GPIO configuration of KEY_BTSE on GPIO_B1_04 (pin E12) */
  gpio_pin_config_t KEY_BTSE_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_04 (pin E12) */
  GPIO_PinInit(GPIO2, 20U, &KEY_BTSE_config);

  /* GPIO configuration of SERVO_EN on GPIO_B1_05 (pin D12) */
  gpio_pin_config_t SERVO_EN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_05 (pin D12) */
  GPIO_PinInit(GPIO2, 21U, &SERVO_EN_config);

  /* GPIO configuration of BEEP_EN on GPIO_B1_06 (pin C12) */
  gpio_pin_config_t BEEP_EN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_06 (pin C12) */
  GPIO_PinInit(GPIO2, 22U, &BEEP_EN_config);

  /* GPIO configuration of KEY_BTDN on GPIO_B1_07 (pin B12) */
  gpio_pin_config_t KEY_BTDN_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_07 (pin B12) */
  GPIO_PinInit(GPIO2, 23U, &KEY_BTDN_config);

  /* GPIO configuration of KEY_BTRT on GPIO_B1_08 (pin A12) */
  gpio_pin_config_t KEY_BTRT_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_08 (pin A12) */
  GPIO_PinInit(GPIO2, 24U, &KEY_BTRT_config);

  /* GPIO configuration of KEY_BTLF on GPIO_B1_09 (pin A13) */
  gpio_pin_config_t KEY_BTLF_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_09 (pin A13) */
  GPIO_PinInit(GPIO2, 25U, &KEY_BTLF_config);

  /* GPIO configuration of KEY_BTOK on GPIO_B1_10 (pin B13) */
  gpio_pin_config_t KEY_BTOK_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_10 (pin B13) */
  GPIO_PinInit(GPIO2, 26U, &KEY_BTOK_config);

  /* GPIO configuration of KEY_BTUP on GPIO_B1_11 (pin C13) */
  gpio_pin_config_t KEY_BTUP_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_11 (pin C13) */
  GPIO_PinInit(GPIO2, 27U, &KEY_BTUP_config);

  /* GPIO configuration of TCS_INT on GPIO_SD_B1_02 (pin M3) */
  gpio_pin_config_t TCS_INT_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_02 (pin M3) */
  GPIO_PinInit(GPIO3, 2U, &TCS_INT_config);

